package day0118;
// 자바의 여러가지 이름 짓는 규칙(Naming Convention)
// 코딩을 하게 되면 여러가지 존재에 대해 이름을 붙여주게 된다

// 공통규칙
// 1. 그 어떤 이름도 특수문자 혹은 숫자로 시작할 수 없다.
// 2. 반드시 알파벳으로 시작해야 한다.
// 3. 숫자의 경우 어떤 숫자도 다 적어도 되지만 특수문자는 _만 사용 가능
// 4. 자바는 대소문자를 엄격하게 구분한다.
//    ㄴ 대소문자가 틀리면 다른 존재이다.
// 5. 한글로 이름을 지어줄 수 있기는 하지만 절대로 그러지 말자
// 6. 자바에는 내부적으로 기능이 설정된 50여가지의 "예약어(keyword)"가 있다

/*
 * 낙타등 표기법과 뱀 표기법

 * 
 * 1. 낙타등 표기법
 *    ㄴ 어떠한 것에 이름을 지어줄때 여러 단어로 이루어져 있을 경우, 두번째 단어부터는 첫글자를 대문자로 적어줘서
 *      몇개의 단어로 이루어져있는지 쉽게 알려주는 표기법
 *    ㄴ ex) userNumber, memberController, UserMemberAuthController
 *    
 * 2. 뱀 표기법
 *    ㄴ 어떠한 것에 이름을 지어줄때 모든 글자를 대문자로 적어주고, 여러 단어일 경우 단어의 사이마다 _를 넣어줘서
 *      몇개의 단어로 이루어져있는지 쉽게 알려주는 표기법이다 
 *    ㄴ ex) UNIT_PRICE, MEMBER_PICTURE_ADDRESS
 */


/*
 * 여러가지 개념들에 대한 이름 짓는 규칙
 * 1. 변수 : 낙타등 표기법을 사용하고 소문자로 시작하는 명사
 * 
 * 2. 상수 : 뱀 표기법을 사용하는 명사
 * 
 * 3. 메소드 : 낙타등 표기법을 사용하고 소문자로 시작하는 동사
 *         : 또한 메소드의 경우 프로그래밍 구조상 반드시 맨 뒤에 ()가 붙는다.
 *         
 * 4. 클래스 : 낙타등 표기법을 사용하고 대문자로 시작하는 명사       
 */
public class Ex2Naming {

}
